#Задача-2: Исходные значения двух переменных запросить у пользователя.
#Поменять значения переменных местами. Вывести новые значения на экран.
a = int(input())
b = int(input())
c = a
a = b
b = c
print(a, b)