#Задание - 4
#Написать печать башенки не более 4 строк. Рост башни задает пользователь. Лучший будешь если 3 строки.
n = int(input('Введите высоту башни'))
for i in range(1, (n + 1)):
  print(i * '*')
 